first_routes_and_controllers_project/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "stella"], ["email", "stella@gmail.com"], ["created_at", "2021-09-15 20:03:48.171621"], ["updated_at", "2021-09-15 20:03:48.171621"]]
---
    def create
        user = User.new(user_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save