first_routes_and_controllers+art_share_API_projects/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks"
---
    def index
        @artworks = Artwork.all