first_routes_and_controllers+art_share_API_projects/app/controllers/artworks_controller.rb

    def index
        @user_artworks = User.find(params[:user_id]).artworks
        @user_shared_artworks = User.find(params[:user_id]).shared_artworks
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @artwork = Artwork.new(artwork_params)
        if @artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "mona lisa"], ["image_url", "mona lisa url"], ["artist_id", 2]]

    def show
        @artwork = Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        @artwork = Artwork.find(params[:id])

        if @artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1 WHERE "artworks"."id" = $2  [["title", "edited mona lisa"], ["id", 7]]

    def destroy
        @artwork = Artwork.find(params[:id])

        @artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 5]]

    def favorite
        @artwork = Artwork.find(params[:id])
        @artwork.favorite = true
        @artwork.save!
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "artworks" SET "favorite" = $1 WHERE "artworks"."id" = $2  [["favorite", true], ["id", 3]]