first_routes_and_controllers+art_share_API_projects/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
        if params[:user_id]
            @comment = User.find(params[:user_id]).comments
        elsif params[:artwork_id]
            @comment = Artwork.find(params[:artwork_id]).comments

INSERT INTO "comments" ("user_id", "artwork_id", "body") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["artwork_id", 1], ["body", "\"i always do the best\""]]
---
    def create
        @comment = Comment.new(comment_params)
        if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]
---
    def destroy
        @comment = Comment.find(params[:id])

        render json: @comment
        @comment.destroy