first_routes_and_controllers+art_share_API_projects/app/controllers/users_controller.rb

    def index
        if params[:username]
            @users = User.find_by(username: params[:username])
        else
            @users = User.all
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "all_knowing_elliot"], ["LIMIT", 1]]
SELECT "users".* FROM "users"

    def create
        @user = User.new(user_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "stella"], ["email", "stella@gmail.com"], ["created_at", "2021-09-15 20:03:48.171621"], ["updated_at", "2021-09-15 20:03:48.171621"]]

    def update
        @user = User.find(params[:id])

        if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "edited_dean"], ["updated_at", "2021-09-15 20:12:23.191239"], ["id", 3]]

    def favorited_artworks
        @favorited_artworks = User.find(params[:id]).favorited_artworks
        @favorited_shared_artworks = User.find(params[:id]).favorited_shared_artworks
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]